In [4]:
#Series的多階層
import numpy as np
import pandas as pd
s1 = pd.Series(np.random.randn(9),
               index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                      [1, 2, 3, 1, 2, 3, 1, 2, 3]])
s1

a  1    0.602808
   2    1.485259
   3    1.234966
b  1   -0.167504
   2    0.253652
c  3    0.146372
   1   -1.219057
d  2    0.835443
   3   -1.806336
dtype: float64

In [5]:
s1.unstack()

          1         2         3
a  0.602808  1.485259  1.234966
b -0.167504  0.253652       NaN
c -1.219057       NaN  0.146372
d       NaN  0.835443 -1.806336

In [9]:
s1.unstack(level=0)

          a         b         c         d
1  0.602808 -0.167504 -1.219057       NaN
2  1.485259  0.253652       NaN  0.835443
3  1.234966       NaN  0.146372 -1.806336

In [12]:
s1.index.names = ['階層1','階層2']
s1

階層1  階層2
a    1      0.602808
     2      1.485259
     3      1.234966
b    1     -0.167504
     2      0.253652
c    3      0.146372
     1     -1.219057
d    2      0.835443
     3     -1.806336
dtype: float64

In [13]:
s1.unstack(level='階層2')

階層2         1         2         3
階層1
a    0.602808  1.485259  1.234966
b   -0.167504  0.253652       NaN
c   -1.219057       NaN  0.146372
d         NaN  0.835443 -1.806336

In [15]:
s1['a']

階層2
1    0.602808
2    1.485259
3    1.234966
dtype: float64

In [18]:
s1['a'][2]

1.4852589392893623

In [21]:
s1.unstack().stack()

階層1  階層2
a    1      0.602808
     2      1.485259
     3      1.234966
b    1     -0.167504
     2      0.253652
c    1     -1.219057
     3      0.146372
d    2      0.835443
     3     -1.806336
dtype: float64

In [26]:
dataFrame = pd.DataFrame(np.arange(12).reshape((4,3)),
             index=[['a','a','b','b'],[1, 2, 1, 2]],
             columns=[['台北','台北','台中'],['Green','Red','Green']])
dataFrame

       台北        台中
    Green Red Green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [28]:
dataFrame.index.names=["key1","key2"]
dataFrame.columns.names=["縣市","顏色"]
dataFrame

縣市           台北        台中
顏色        Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [29]:
dataFrame.stack()

縣市               台北    台中
key1 key2 顏色
a    1    Green   0   2.0
          Red     1   NaN
     2    Green   3   5.0
          Red     4   NaN
b    1    Green   6   8.0
          Red     7   NaN
     2    Green   9  11.0
          Red    10   NaN

In [32]:
dataFrame1 = dataFrame.stack(level=['縣市','顏色'])
dataFrame1

key1  key2  縣市  顏色
a     1     台中  Green     2.0
            台北  Green     0.0
                Red       1.0
      2     台中  Green     5.0
            台北  Green     3.0
                Red       4.0
b     1     台中  Green     8.0
            台北  Green     6.0
                Red       7.0
      2     台中  Green    11.0
            台北  Green     9.0
                Red      10.0
dtype: float64

In [33]:
dataFrame1.unstack(level=['縣市','key1'])

縣市           台中   台北    台中    台北
key1          a    a     b     b
key2 顏色
1    Green  2.0  0.0   8.0   6.0
     Red    NaN  1.0   NaN   7.0
2    Green  5.0  3.0  11.0   9.0
     Red    NaN  4.0   NaN  10.0

In [34]:
#set_index()->把欄位變為索引
#reset_index()->把索引變為欄位
frame = pd.DataFrame({'a':range(7), 'b':range(7, 0, -1),
                     'c':['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                     'd':[0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [35]:
frame1 = frame.set_index(keys=['c','d'])
frame1

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [36]:
#當要unstack時,請小心,組合的索引,必需是唯一的
frame1.unstack(level='d')

       a                   b
d      0    1    2    3    0    1    2    3
c
one  0.0  1.0  2.0  NaN  7.0  6.0  5.0  NaN
two  3.0  4.0  5.0  6.0  4.0  3.0  2.0  1.0

In [39]:
frame1.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1